_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 128, 3)            0         
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 128, 100)          3100      
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 64, 100)           0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 64, 100)           100100    
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 32, 100)           0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 32, 100)           100100    
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 16, 100)           0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 16, 100)           100100    
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 8, 100)            0         
_________________________________________________________________
conv1d_5 (Conv1D)            (None, 8, 100)            100100    
_________________________________________________________________
max_pooling1d_5 (MaxPooling1 (None, 4, 100)            0         
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 4, 100)            100100    
_________________________________________________________________
max_pooling1d_6 (MaxPooling1 (None, 2, 100)            0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 200)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 402       
_________________________________________________________________
dense_2 (Dense)              (None, 200)               600       
_________________________________________________________________
reshape_1 (Reshape)          (None, 2, 100)            0         
_________________________________________________________________
conv1d_7 (Conv1D)            (None, 2, 100)            100100    
_________________________________________________________________
up_sampling1d_1 (UpSampling1 (None, 4, 100)            0         
_________________________________________________________________
conv1d_8 (Conv1D)            (None, 4, 100)            100100    
_________________________________________________________________
up_sampling1d_2 (UpSampling1 (None, 8, 100)            0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 8, 100)            100100    
_________________________________________________________________
up_sampling1d_3 (UpSampling1 (None, 16, 100)           0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 16, 100)           100100    
_________________________________________________________________
up_sampling1d_4 (UpSampling1 (None, 32, 100)           0         
_________________________________________________________________
conv1d_11 (Conv1D)           (None, 32, 100)           100100    
_________________________________________________________________
up_sampling1d_5 (UpSampling1 (None, 64, 100)           0         
_________________________________________________________________
conv1d_12 (Conv1D)           (None, 64, 100)           100100    
_________________________________________________________________
up_sampling1d_6 (UpSampling1 (None, 128, 100)          0         
_________________________________________________________________
conv1d_13 (Conv1D)           (None, 128, 3)            3003      
=================================================================
Total params: 1,108,205
Trainable params: 1,108,205
Non-trainable params: 0
_________________________________________________________________
